
# Inclass 
Ivan Zepeda
c0883949

## MOdule2

In [29]:
import sqlite3

In [35]:

#create a connection object
conn = sqlite3.connect('example.db')
# a cursor is a method of the connection object
cursor = conn.cursor()

In [13]:
#create an sql within a text
sql='''CREATE TABLE EMPLOYEE(
        FIRST_NAME CHAR(20) NOT NULL,
        LAST_NAME CHAR(20),
        AGE INT NOT NULL,
        SEX CHAR(1),
        INCOME FLOAT)'''
#excecute to sql queries
conn.execute(sql)

#commit after each transaction
conn.commit()

OperationalError: table EMPLOYEE already exists

**View Schema: MEthod 1**

In [34]:

# Execute PRAGMA statement to get the table information
cursor.execute("PRAGMA table_info(EMPLOYEE)")

# Fetch all the results
results = cursor.fetchall()

# Print the schema information
for column in results:
    print(column)

# Close the cursor and connection
cursor.close()
conn.close()

(0, 'FIRST_NAME', 'CHAR(20)', 1, None, 0)
(1, 'LAST_NAME', 'CHAR(20)', 0, None, 0)
(2, 'AGE', 'INT', 1, None, 0)
(3, 'SEX', 'CHAR(1)', 0, None, 0)
(4, 'INCOME', 'FLOAT', 0, None, 0)

**View Schema: MEthod 1**

In [28]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('example.db')
cursor = conn.cursor()

# Execute PRAGMA statement to get the table information
cursor.execute("PRAGMA table_info(EMPLOYEE)")

# Fetch all the results
results = cursor.fetchall()

# Extract column names from the results
column_names = [column[1] for column in results]

# Print the column names
for name in column_names:
    print(name)

# Close the cursor and connection
# cursor.close()
# conn.close()

FIRST_NAME
LAST_NAME
AGE
SEX
INCOME


**Insert records**

In [50]:
def insert(name, last, age, sex, income=0):

    sql=f"""INSERT INTO EMPLOYEE(
    FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES
    ('{name}', '{last}', {age},'{sex}',{income})"""
    conn.execute(sql)
    conn.commit()

list_employees=[
    {'name':'Ramya', 'last':'Rama Priya','age':27,'sex':'F','income':9000},
    {'name':'Sharukh', 'last':'Sheik','age':25 ,'sex':'M','income':8300},
    {'name':'Sarmista', 'last':'Sharma','age':26,'sex':'F','income':10000},
    {'name':'Sharukh', 'last':'Sheik','age':25 ,'sex':'M','income':8300},
    {'name':'Sharukh', 'last':'Sheik','age':25 ,'sex':'M','income':8300},
    {'name':'Sharukh', 'last':'Sharma','age':26 ,'sex':'F','income':1000},
]
for e in list_employees:
    insert(**e)

Ramya
Rama Priya
27
F
Sharukh
Sheik
25
M
Sarmista
Sharma
26
F
Sharukh
Sheik
25
M
Sharukh
Sheik
25
M
Sharukh
Sharma
26
F

**Excecute many**

In [55]:

# Define the list of employees to insert
list_employees = [
    ('Ramya2', 'Rama Priya2', 27, 'F', 9000),
    ('John', 'Doe', 35, 'M', 7500),
    ('Emily', 'Smith', 29, 'F', 8200),
    # Add more employee data as needed
]

# Define the SQL INSERT statement
sql = "INSERT INTO EMPLOYEE (first_name, last_name, age, sex, income) VALUES (?, ?, ?, ?, ?)"

# Execute the bulk insert operation
cursor.executemany(sql, list_employees)

# Commit the changes to the database
conn.commit()

### READ
In SQLite, there is no built-in functionality to directly restore a cursor to a previous position or start. Once you have iterated through the results using the cursor, you cannot go back to a previous position or reset the cursor to the beginning.

However, you can achieve similar functionality by storing the results in a separate data structure, such as a list or tuple, and then iterate over that data structure multiple times as needed. This way, you can effectively "restore" the cursor to a previous position or start by accessing the stored results again.

In [69]:
cursor.execute("SELECT * from EMPLOYEE")

In [57]:
result=cursor.fetchone()
print(result)

('Ramya', 'Rama Priya', 27, 'F', 9000.0)

In [58]:
result = cursor.fetchall()
print(result)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sarmista', 'Sharma', 26, 'F', 10000.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sharukh', 'Sheik', 25, 'M', 8300.0), ('Sharukh', 'Sharma', 26, 'F', 1000.0), ('Ramya2', 'Rama Priya2', 27, 'F', 9000.0), ('John', 'Doe', 35, 'M', 7500.0), ('Emily', 'Smith', 29, 'F', 8200.0)]

In [70]:
# cursor.
result= cursor.fetchmany(2)
print(result)

[('Ramya', 'Rama Priya', 27, 'F', 9000.0), ('Ramya', 'Rama Priya', 27, 'F', 9000.0)]

## UPDATE
Use with **SET** and **WHERE**

In [79]:
sql="UPDATE EMPLOYEE SET AGE=AGE+10 WHERE SEX='M'"
cursor.execute(sql)

In [80]:
cursor.execute("SELECT * FROM EMPLOYEE")
r=cursor.fetchall()
for i in r:
    print(i)

('Ramya', 'Rama Priya', 27, 'F', 9000.0)
('Ramya', 'Rama Priya', 27, 'F', 9000.0)
('Sharukh', 'Sheik', 37, 'M', 8300.0)
('Sarmista', 'Sharma', 26, 'F', 10000.0)
('Sharukh', 'Sheik', 37, 'M', 8300.0)
('Sharukh', 'Sheik', 37, 'M', 8300.0)
('Sharukh', 'Sharma', 26, 'F', 1000.0)
('Ramya2', 'Rama Priya2', 27, 'F', 9000.0)
('John', 'Doe', 47, 'M', 7500.0)
('Emily', 'Smith', 29, 'F', 8200.0)

### ALTER
modification of shcema, like renaming a column
**ALTER**

In [90]:
#ADD COLUMN
# cursor.execute("ALTER TABLE your_table ADD COLUMN new_column_name datatype")

# DROP COLUMN
# cursor.execute("ALTER TABLE your_table DROP COLUMN column_to_drop")


#cursor.execute("ALTER TABLE your_table RENAME COLUMN old_column_name TO new_column_name")
sql = "ALTER TABLE EMPLOYEE RENAME COLUMN sex TO GENDER"
cursor.execute(sql)

In [106]:
cursor.execute("PRAGMA table_info(EMPLOYEE)")
r = cursor.fetchall()
for c in r:
    print(c)
print()
cursor.execute("Select * from Employee")
r=cursor.fetchall()
for i in r:
    print(i)

OperationalError: no such table: Employee

### ALTER Rename table
do not need to type the name again, as it is indicated at the beginning

In [107]:

sql = "ALTER TABLE EMPLOYEE RENAME TO IVANEE"
cursor.execute(sql)

OperationalError: no such table: EMPLOYEE

### GET ALL TABLES IN DB

In [116]:
def view_database():
    # Execute the query to retrieve table names
    cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")

    # Fetch all the table names
    tables = cursor.fetchall()

    # Print the table names
    for table in tables:
        print(table[0])
view_database()

In [110]:
cursor.execute("PRAGMA table_info(IVANEE)")
r = cursor.fetchall()
for c in r:
    print(c)
print()
cursor.execute("Select * from IVANEE")
r=cursor.fetchall()
for i in r:
    print(i)

(0, 'FIRST_NAME', 'CHAR(20)', 1, None, 0)
(1, 'LAST_NAME', 'CHAR(20)', 0, None, 0)
(2, 'AGE', 'INT', 1, None, 0)
(3, 'SEX', 'CHAR(1)', 0, None, 0)
(4, 'INCOME', 'FLOAT', 0, None, 0)

('Ramya', 'Rama Priya', 27, 'F', 9000.0)
('Ramya', 'Rama Priya', 27, 'F', 9000.0)
('Sharukh', 'Sheik', 25, 'M', 8300.0)
('Sarmista', 'Sharma', 26, 'F', 10000.0)
('Sharukh', 'Sheik', 25, 'M', 8300.0)
('Sharukh', 'Sheik', 25, 'M', 8300.0)
('Sharukh', 'Sharma', 26, 'F', 1000.0)
('Ramya2', 'Rama Priya2', 27, 'F', 9000.0)
('John', 'Doe', 35, 'M', 7500.0)
('Emily', 'Smith', 29, 'F', 8200.0)

**Task**:
task create table pd df.read_sql()    


pandas.read_sql(sql, con, index_col=None, coerce_float=True, params=None, parse_dates=None, columns=None, chunksize=None, dtype_backend=_NoDefault.no_default, dtype=None)[source]

In [111]:
import pandas as pd
sql="Select * from IVANEE"
df = pd.read_sql(sql,conn )

In [112]:
df

  FIRST_NAME    LAST_NAME  AGE SEX   INCOME
0      Ramya   Rama Priya   27   F   9000.0
1      Ramya   Rama Priya   27   F   9000.0
2    Sharukh        Sheik   25   M   8300.0
3   Sarmista       Sharma   26   F  10000.0
4    Sharukh        Sheik   25   M   8300.0
5    Sharukh        Sheik   25   M   8300.0
6    Sharukh       Sharma   26   F   1000.0
7     Ramya2  Rama Priya2   27   F   9000.0
8       John          Doe   35   M   7500.0
9      Emily        Smith   29   F   8200.0

## MISSED TASK

## Delete values

In [113]:
sql="DELETE FROM IVANEE WHERE AGE>20"
cursor.execute(sql)
r=cursor.fetchall()
for c in r:
    print(c)

## DROP TABLE

In [115]:
sql="DROP TABLE IVANEE"
cursor.execute(sql)
view_database()

# NOSQL
## MongoDB
### pymongo

In [117]:
import pymongo
from pymongo import MongoClient

In [118]:
client = MongoClient()
db=client.test

In [119]:
employee= db.employee